In [1]:
import pandas as pd
import  plotly
import json
import requests
import numpy as np

# Getting 2021 happiness report dataset
and importing its useful data to our fakePerson dataset

In [531]:
df=pd.read_csv("randomUsers.csv")

In [532]:
happ= pd.read_csv("happines21.csv")
happ.head()

,Country name,Regional indicator,Ladder score,Standard error of ladder score,upperwhisker,lowerwhisker,Logged GDP per capita,Social support,Healthy life expectancy,Freedom to make life choices,Generosity,Perceptions of corruption,Ladder score in Dystopia,Explained by: Log GDP per capita,Explained by: Social support,Explained by: Healthy life expectancy,Explained by: Freedom to make life choices,Explained by: Generosity,Explained by: Perceptions of corruption,Dystopia + residual
0,Finland,Western Europe,7.842,0.032,7.904,7.780,10.775,0.954,72.0,0.949,-0.098,0.186,2.43,1.446,1.106,0.741,0.691,0.124,0.481,3.253
1,Denmark,Western Europe,7.620,0.035,7.687,7.552,10.933,0.954,72.7,0.946,0.030,0.179,2.43,1.502,1.108,0.763,0.686,0.208,0.485,2.868
2,Switzerland,Western Europe,7.571,0.036,7.643,7.500,11.117,0.942,74.4,0.919,0.025,0.292,2.43,1.566,1.079,0.816,0.653,0.204,0.413,2.839
3,Iceland,Western Europe,7.554,0.059,7.670,7.438,10.878,0.983,73.0,0.955,0.160,0.673,2.43,1.482,1.172,0.772,0.698,0.293,0.170,2.967
4,Netherlands,Western Europe,7.464,0.027,7.518,7.410,10.932,0.942,72.4,0.913,0.175,0.338,2.43,1.501,1.079,0.753,0.647,0.302,0.384,2.798

In [533]:
cols = happ.columns
# cols[[0,2]]
hdf= happ[cols[[0,2]]]
hdf

    Country name  Ladder score
0        Finland         7.842
1        Denmark         7.620
2    Switzerland         7.571
3        Iceland         7.554
4    Netherlands         7.464
..           ...           ...
144      Lesotho         3.512
145     Botswana         3.467
146       Rwanda         3.415
147     Zimbabwe         3.145
148  Afghanistan         2.523

[149 rows x 2 columns]

In [534]:
df["location.country"].unique()

array(['Denmark', 'Ukraine', 'Iran', 'Australia', 'Ireland',
       'United States', 'Canada', 'United Kingdom', 'France',
       'Netherlands', 'Spain', 'Norway', 'Switzerland', 'Brazil',
       'Serbia', 'New Zealand', 'Germany', 'Turkey', 'Finland', 'Mexico',
       'India'], dtype=object)

In [535]:
def findinSeries(elem, series):
    # print(elem)
    for i,x in enumerate(series):
        if x== elem:
            # print("i",i, x)
            return i
    return -1

In [536]:
copydf= df
# copydf["happiness"] = np.where(copydf["location.country"] in hdf[cols[0]].tolist(),"wa3 bla3","")
copydf["happiness"] = copydf["location.country"].apply(lambda x: hdf['Ladder score'][findinSeries(x,hdf['Country name'].tolist())] if x in hdf[cols[0]].tolist() else "")
copydf[["happiness","location.country"]]

       happiness location.country
0          7.620          Denmark
1          4.875          Ukraine
2          4.721             Iran
3          7.183        Australia
4          4.875          Ukraine
...          ...              ...
16995      7.571      Switzerland
16996      7.620          Denmark
16997      6.317           Mexico
16998      7.392           Norway
16999      4.721             Iran

[17000 rows x 2 columns]

In [537]:
copydf.head()

,gender,name.title,name.first,name.last,location.street.number,location.street.name,location.city,location.state,location.country,location.postcode,location.coordinates.latitude,location.coordinates.longitude,location.timezone.offset,location.timezone.description,dob.date,dob.age,happiness
0,male,Mr,Storm,Madsen,6771,Svinget,Randers Nø,Hovedstaden,Denmark,87306,-46.1343,-86.6480,-3:30,Newfoundland,1986-03-17T15:41:16.272Z,36,7.620
1,male,Mr,Gordoslav,Bosik,3517,Pogulyanka,Ternopil,Ivano-Frankivska,Ukraine,83512,78.7516,-108.7593,-9:00,Alaska,1963-07-05T17:37:05.470Z,59,4.875
2,female,Mrs,آرمیتا,محمدخان,3010,امام خمینی,دزفول,خراسان رضوی,Iran,46674,19.8684,175.9099,+6:00,"Almaty, Dhaka, Colombo",1986-07-21T20:06:46.754Z,36,4.721
3,male,Mr,Daryl,Chambers,7096,Spring Hill Rd,Busselton,New South Wales,Australia,5724,-87.1313,-77.0928,-9:00,Alaska,1972-04-18T18:38:04.636Z,50,7.183
4,male,Mr,Bilogost,Drizhenko,7323,Kerchenska ploshcha,Kam'yanske,Odeska,Ukraine,13704,78.2755,-78.9680,-2:00,Mid-Atlantic,1950-12-08T08:21:03.631Z,71,4.875

In [538]:
copydf["happiness"] = copydf["happiness"]+np.random.randint(-2,3,copydf.shape[0])

# Filling the rest of the columns Case by Case

In [539]:
# questionnaire = pd.read_csv("questionnaire.csv")
# # questionnaire.columns= pd.Series(questionnaire.columns).apply(lambda x: x.replace(" ","_"))
# # questionnaire = questionnaire.drop(['Unnamed: 0'],axis=1)
# # questionnaire= questionnaire.rename(columns={'Name_initials':'Name'})
# questionnaire.to_csv("questionnaire.csv")
# len(questionnaire.columns.tolist())co
copydf[copydf.columns[[2,-1]]]

      name.first  happiness
0          Storm      6.620
1      Gordoslav      2.875
2         آرمیتا      5.721
3          Daryl      9.183
4       Bilogost      6.875
...          ...        ...
16995    Eduardo      6.571
16996     Olivia      5.620
16997     Estela      4.317
16998       Ivan      6.392
16999       مانی      4.721

[17000 rows x 2 columns]

In [540]:
questDF= pd.DataFrame()
questDF

Empty DataFrame
Columns: []
Index: []

## Personal Info

### Name

In [541]:
columnIndex= 0
questDF[columnIndex]= copydf['name.first']+" "+ copydf['name.last']
questDF.rename(columns={columnIndex:"Name"}, inplace=True)
questDF

                     Name
0            Storm Madsen
1         Gordoslav Bosik
2          آرمیتا محمدخان
3          Daryl Chambers
4      Bilogost Drizhenko
...                   ...
16995       Eduardo Colin
16996   Olivia Kristensen
16997         Estela Rojo
16998      Ivan Hillestad
16999          مانی حسینی

[17000 rows x 1 columns]

### Gender

In [542]:
columnIndex= 1
questDF[columnIndex]= copydf['gender']
questDF.rename(columns={columnIndex:"Gender"}, inplace=True)
questDF

                     Name  Gender
0            Storm Madsen    male
1         Gordoslav Bosik    male
2          آرمیتا محمدخان  female
3          Daryl Chambers    male
4      Bilogost Drizhenko    male
...                   ...     ...
16995       Eduardo Colin    male
16996   Olivia Kristensen  female
16997         Estela Rojo  female
16998      Ivan Hillestad    male
16999          مانی حسینی    male

[17000 rows x 2 columns]

### Age

In [543]:
columnIndex= 2
questDF[columnIndex]= copydf['dob.age']
questDF.rename(columns={columnIndex:"Age"}, inplace=True)
questDF

                     Name  Gender  Age
0            Storm Madsen    male   36
1         Gordoslav Bosik    male   59
2          آرمیتا محمدخان  female   36
3          Daryl Chambers    male   50
4      Bilogost Drizhenko    male   71
...                   ...     ...  ...
16995       Eduardo Colin    male   73
16996   Olivia Kristensen  female   27
16997         Estela Rojo  female   67
16998      Ivan Hillestad    male   67
16999          مانی حسینی    male   67

[17000 rows x 3 columns]

### Ethnicity

In [544]:
columnIndex= 3
ethnicities = ["Hispanic", "White", "Black", "Asian", "Arab"]
questDF[columnIndex]= np.random.choice(ethnicities, questDF.shape[0])
questDF.rename(columns={columnIndex:"Ethnicity"}, inplace=True)
questDF

                     Name  Gender  Age Ethnicity
0            Storm Madsen    male   36      Arab
1         Gordoslav Bosik    male   59     Black
2          آرمیتا محمدخان  female   36     Black
3          Daryl Chambers    male   50     Asian
4      Bilogost Drizhenko    male   71     White
...                   ...     ...  ...       ...
16995       Eduardo Colin    male   73     Black
16996   Olivia Kristensen  female   27     Black
16997         Estela Rojo  female   67      Arab
16998      Ivan Hillestad    male   67      Arab
16999          مانی حسینی    male   67  Hispanic

[17000 rows x 4 columns]

## Family

### Family Status

In [545]:
columnIndex= 4
statuses = ['Abandonned', 'Adopted', 'biological family', 'step family', 'extended family']
questDF[columnIndex]= np.random.choice(statuses, questDF.shape[0])
questDF.rename(columns={columnIndex:"Family_Status"}, inplace=True)
questDF

                     Name  Gender  Age Ethnicity      Family_Status
0            Storm Madsen    male   36      Arab         Abandonned
1         Gordoslav Bosik    male   59     Black            Adopted
2          آرمیتا محمدخان  female   36     Black    extended family
3          Daryl Chambers    male   50     Asian        step family
4      Bilogost Drizhenko    male   71     White  biological family
...                   ...     ...  ...       ...                ...
16995       Eduardo Colin    male   73     Black    extended family
16996   Olivia Kristensen  female   27     Black            Adopted
16997         Estela Rojo  female   67      Arab            Adopted
16998      Ivan Hillestad    male   67      Arab            Adopted
16999          مانی حسینی    male   67  Hispanic    extended family

[17000 rows x 5 columns]

### Number Of Caretakers

In [546]:
columnIndex= 5
questDF[columnIndex]= np.random.choice(list(range(1,6)), questDF.shape[0])
questDF.rename(columns={columnIndex:"Number_Caretakers"}, inplace=True)
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers
0,Storm Madsen,male,36,Arab,Abandonned,4
1,Gordoslav Bosik,male,59,Black,Adopted,2
2,آرمیتا محمدخان,female,36,Black,extended family,5
3,Daryl Chambers,male,50,Asian,step family,3
4,Bilogost Drizhenko,male,71,White,biological family,5
...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4
16996,Olivia Kristensen,female,27,Black,Adopted,4
16997,Estela Rojo,female,67,Arab,Adopted,1
16998,Ivan Hillestad,male,67,Arab,Adopted,5
16999,مانی حسینی,male,67,Hispanic,extended family,5

In [547]:
def fillState(dataframe,index,name,min=1,max=11):
    dataframe[index]= np.random.choice(list(range(min,max)), dataframe.shape[0])
    dataframe.rename(columns={index:name}, inplace=True)
    return dataframe

### State of Caretakers

In [548]:
# columnIndex= 6
# questDF[columnIndex]= np.random.choice(list(range(1,11)), questDF.shape[0])
# questDF.rename(columns={columnIndex:"State_Caretakers"}, inplace=True)
questDF = fillState(questDF,6,"State_Caretakers")
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers
0,Storm Madsen,male,36,Arab,Abandonned,4,2
1,Gordoslav Bosik,male,59,Black,Adopted,2,10
2,آرمیتا محمدخان,female,36,Black,extended family,5,5
3,Daryl Chambers,male,50,Asian,step family,3,4
4,Bilogost Drizhenko,male,71,White,biological family,5,7
...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9
16996,Olivia Kristensen,female,27,Black,Adopted,4,10
16997,Estela Rojo,female,67,Arab,Adopted,1,2
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1
16999,مانی حسینی,male,67,Hispanic,extended family,5,9

### Number of Siblings

In [549]:
columnIndex= 7
questDF[columnIndex]= np.random.choice(list(range(1,5)), questDF.shape[0])
questDF.rename(columns={columnIndex:"Number_Siblings"}, inplace=True)
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings
0,Storm Madsen,male,36,Arab,Abandonned,4,2,2
1,Gordoslav Bosik,male,59,Black,Adopted,2,10,3
2,آرمیتا محمدخان,female,36,Black,extended family,5,5,3
3,Daryl Chambers,male,50,Asian,step family,3,4,1
4,Bilogost Drizhenko,male,71,White,biological family,5,7,2
...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9,2
16996,Olivia Kristensen,female,27,Black,Adopted,4,10,2
16997,Estela Rojo,female,67,Arab,Adopted,1,2,4
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1,2
16999,مانی حسینی,male,67,Hispanic,extended family,5,9,4

### Order Among Siblings

In [550]:
columnIndex= 8
questDF[columnIndex]= questDF['Number_Siblings'].apply(lambda x: np.random.randint(1,x+1))
questDF.rename(columns={columnIndex:"Order_Among_Siblings"}, inplace=True)
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings
0,Storm Madsen,male,36,Arab,Abandonned,4,2,2,2
1,Gordoslav Bosik,male,59,Black,Adopted,2,10,3,2
2,آرمیتا محمدخان,female,36,Black,extended family,5,5,3,3
3,Daryl Chambers,male,50,Asian,step family,3,4,1,1
4,Bilogost Drizhenko,male,71,White,biological family,5,7,2,1
...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9,2,1
16996,Olivia Kristensen,female,27,Black,Adopted,4,10,2,2
16997,Estela Rojo,female,67,Arab,Adopted,1,2,4,1
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1,2,1
16999,مانی حسینی,male,67,Hispanic,extended family,5,9,4,3

## Location

### State of Residence

In [551]:
questDF = fillState(questDF,9,"State_Residence")
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings,State_Residence
0,Storm Madsen,male,36,Arab,Abandonned,4,2,2,2,5
1,Gordoslav Bosik,male,59,Black,Adopted,2,10,3,2,9
2,آرمیتا محمدخان,female,36,Black,extended family,5,5,3,3,9
3,Daryl Chambers,male,50,Asian,step family,3,4,1,1,6
4,Bilogost Drizhenko,male,71,White,biological family,5,7,2,1,5
...,...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9,2,1,9
16996,Olivia Kristensen,female,27,Black,Adopted,4,10,2,2,9
16997,Estela Rojo,female,67,Arab,Adopted,1,2,4,1,6
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1,2,1,9
16999,مانی حسینی,male,67,Hispanic,extended family,5,9,4,3,7

### Country

In [552]:
columnIndex= 10
questDF[columnIndex]= copydf['location.country']
questDF.rename(columns={columnIndex:"Country"}, inplace=True)
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings,State_Residence,Country
0,Storm Madsen,male,36,Arab,Abandonned,4,2,2,2,5,Denmark
1,Gordoslav Bosik,male,59,Black,Adopted,2,10,3,2,9,Ukraine
2,آرمیتا محمدخان,female,36,Black,extended family,5,5,3,3,9,Iran
3,Daryl Chambers,male,50,Asian,step family,3,4,1,1,6,Australia
4,Bilogost Drizhenko,male,71,White,biological family,5,7,2,1,5,Ukraine
...,...,...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9,2,1,9,Switzerland
16996,Olivia Kristensen,female,27,Black,Adopted,4,10,2,2,9,Denmark
16997,Estela Rojo,female,67,Arab,Adopted,1,2,4,1,6,Mexico
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1,2,1,9,Norway
16999,مانی حسینی,male,67,Hispanic,extended family,5,9,4,3,7,Iran

### State of Country

In [553]:
name="State_Country"
questDF[name]= np.where(copydf["happiness"]>10, 10, copydf["happiness"])
questDF["State_Country"]

0        6.620
1        2.875
2        5.721
3        9.183
4        6.875
         ...
16995    6.571
16996    5.620
16997    4.317
16998    6.392
16999    4.721
Name: State_Country, Length: 17000, dtype: float64

### State

In [554]:
columnIndex= 12
questDF[columnIndex]= copydf['location.state']
questDF.rename(columns={columnIndex:"State"}, inplace=True)
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings,State_Residence,Country,State_Country,State
0,Storm Madsen,male,36,Arab,Abandonned,4,2,2,2,5,Denmark,6.620,Hovedstaden
1,Gordoslav Bosik,male,59,Black,Adopted,2,10,3,2,9,Ukraine,2.875,Ivano-Frankivska
2,آرمیتا محمدخان,female,36,Black,extended family,5,5,3,3,9,Iran,5.721,خراسان رضوی
3,Daryl Chambers,male,50,Asian,step family,3,4,1,1,6,Australia,9.183,New South Wales
4,Bilogost Drizhenko,male,71,White,biological family,5,7,2,1,5,Ukraine,6.875,Odeska
...,...,...,...,...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9,2,1,9,Switzerland,6.571,Glarus
16996,Olivia Kristensen,female,27,Black,Adopted,4,10,2,2,9,Denmark,5.620,Hovedstaden
16997,Estela Rojo,female,67,Arab,Adopted,1,2,4,1,6,Mexico,4.317,Estado de Mexico
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1,2,1,9,Norway,6.392,Møre og Romsdal
16999,مانی حسینی,male,67,Hispanic,extended family,5,9,4,3,7,Iran,4.721,بوشهر

### State Of State

In [555]:
columnIndex=13
questDF[columnIndex]= questDF['State_Country'].apply(lambda x: np.random.randint(1,x+1))
questDF.rename(columns={columnIndex:"State_State"}, inplace=True)
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings,State_Residence,Country,State_Country,State,State_State
0,Storm Madsen,male,36,Arab,Abandonned,4,2,2,2,5,Denmark,6.620,Hovedstaden,2
1,Gordoslav Bosik,male,59,Black,Adopted,2,10,3,2,9,Ukraine,2.875,Ivano-Frankivska,1
2,آرمیتا محمدخان,female,36,Black,extended family,5,5,3,3,9,Iran,5.721,خراسان رضوی,4
3,Daryl Chambers,male,50,Asian,step family,3,4,1,1,6,Australia,9.183,New South Wales,4
4,Bilogost Drizhenko,male,71,White,biological family,5,7,2,1,5,Ukraine,6.875,Odeska,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9,2,1,9,Switzerland,6.571,Glarus,2
16996,Olivia Kristensen,female,27,Black,Adopted,4,10,2,2,9,Denmark,5.620,Hovedstaden,5
16997,Estela Rojo,female,67,Arab,Adopted,1,2,4,1,6,Mexico,4.317,Estado de Mexico,1
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1,2,1,9,Norway,6.392,Møre og Romsdal,4
16999,مانی حسینی,male,67,Hispanic,extended family,5,9,4,3,7,Iran,4.721,بوشهر,1

## Education
### State Of School

In [556]:
questDF= fillState(questDF,14,"State_School")
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings,State_Residence,Country,State_Country,State,State_State,State_School
0,Storm Madsen,male,36,Arab,Abandonned,4,2,2,2,5,Denmark,6.620,Hovedstaden,2,7
1,Gordoslav Bosik,male,59,Black,Adopted,2,10,3,2,9,Ukraine,2.875,Ivano-Frankivska,1,3
2,آرمیتا محمدخان,female,36,Black,extended family,5,5,3,3,9,Iran,5.721,خراسان رضوی,4,7
3,Daryl Chambers,male,50,Asian,step family,3,4,1,1,6,Australia,9.183,New South Wales,4,4
4,Bilogost Drizhenko,male,71,White,biological family,5,7,2,1,5,Ukraine,6.875,Odeska,4,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9,2,1,9,Switzerland,6.571,Glarus,2,2
16996,Olivia Kristensen,female,27,Black,Adopted,4,10,2,2,9,Denmark,5.620,Hovedstaden,5,9
16997,Estela Rojo,female,67,Arab,Adopted,1,2,4,1,6,Mexico,4.317,Estado de Mexico,1,9
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1,2,1,9,Norway,6.392,Møre og Romsdal,4,10
16999,مانی حسینی,male,67,Hispanic,extended family,5,9,4,3,7,Iran,4.721,بوشهر,1,8

### State Teachers

In [557]:
questDF= fillState(questDF,15, "State_Teachers")
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings,State_Residence,Country,State_Country,State,State_State,State_School,State_Teachers
0,Storm Madsen,male,36,Arab,Abandonned,4,2,2,2,5,Denmark,6.620,Hovedstaden,2,7,3
1,Gordoslav Bosik,male,59,Black,Adopted,2,10,3,2,9,Ukraine,2.875,Ivano-Frankivska,1,3,4
2,آرمیتا محمدخان,female,36,Black,extended family,5,5,3,3,9,Iran,5.721,خراسان رضوی,4,7,4
3,Daryl Chambers,male,50,Asian,step family,3,4,1,1,6,Australia,9.183,New South Wales,4,4,7
4,Bilogost Drizhenko,male,71,White,biological family,5,7,2,1,5,Ukraine,6.875,Odeska,4,4,6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9,2,1,9,Switzerland,6.571,Glarus,2,2,7
16996,Olivia Kristensen,female,27,Black,Adopted,4,10,2,2,9,Denmark,5.620,Hovedstaden,5,9,5
16997,Estela Rojo,female,67,Arab,Adopted,1,2,4,1,6,Mexico,4.317,Estado de Mexico,1,9,2
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1,2,1,9,Norway,6.392,Møre og Romsdal,4,10,4
16999,مانی حسینی,male,67,Hispanic,extended family,5,9,4,3,7,Iran,4.721,بوشهر,1,8,5

### State Classmates

In [558]:
questDF= fillState(questDF,16,"State_Classmates")
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings,State_Residence,Country,State_Country,State,State_State,State_School,State_Teachers,State_Classmates
0,Storm Madsen,male,36,Arab,Abandonned,4,2,2,2,5,Denmark,6.620,Hovedstaden,2,7,3,2
1,Gordoslav Bosik,male,59,Black,Adopted,2,10,3,2,9,Ukraine,2.875,Ivano-Frankivska,1,3,4,9
2,آرمیتا محمدخان,female,36,Black,extended family,5,5,3,3,9,Iran,5.721,خراسان رضوی,4,7,4,6
3,Daryl Chambers,male,50,Asian,step family,3,4,1,1,6,Australia,9.183,New South Wales,4,4,7,5
4,Bilogost Drizhenko,male,71,White,biological family,5,7,2,1,5,Ukraine,6.875,Odeska,4,4,6,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9,2,1,9,Switzerland,6.571,Glarus,2,2,7,2
16996,Olivia Kristensen,female,27,Black,Adopted,4,10,2,2,9,Denmark,5.620,Hovedstaden,5,9,5,1
16997,Estela Rojo,female,67,Arab,Adopted,1,2,4,1,6,Mexico,4.317,Estado de Mexico,1,9,2,9
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1,2,1,9,Norway,6.392,Møre og Romsdal,4,10,4,10
16999,مانی حسینی,male,67,Hispanic,extended family,5,9,4,3,7,Iran,4.721,بوشهر,1,8,5,1

### Academic Level

In [559]:
columnIndex= 21
Levels=['A+', 'A', 'A−', 'B+', 'B', 'B−', 'C+', 'C', 'C−', 'D+', 'D', 'D−', 'F']
questDF[columnIndex]= np.random.choice(Levels, questDF.shape[0])
questDF.rename(columns={columnIndex:"Academic_Level"}, inplace=True)
questDF["Academic_Level"]

0        D−
1         F
2         A
3        C−
4        D+
         ..
16995    B+
16996    D−
16997    B+
16998    C−
16999    D+
Name: Academic_Level, Length: 17000, dtype: object

### Grade

In [560]:
columnIndex=22
grades= list(range(1,15))+["L1","L2","L3","M1","M2"]
questDF[columnIndex]= np.random.choice(grades, questDF.shape[0])
questDF.rename(columns={columnIndex:"Grade"}, inplace=True)

questDF[questDF.columns[[0,-2,-1]]]

                     Name Academic_Level Grade
0            Storm Madsen             D−    10
1         Gordoslav Bosik              F    11
2          آرمیتا محمدخان              A     3
3          Daryl Chambers             C−    M1
4      Bilogost Drizhenko             D+     6
...                   ...            ...   ...
16995       Eduardo Colin             B+    11
16996   Olivia Kristensen             D−     7
16997         Estela Rojo             B+    L2
16998      Ivan Hillestad             C−    L1
16999          مانی حسینی             D+     6

[17000 rows x 3 columns]

### Academic Passion

In [561]:
questDF= fillState(questDF,23,"Academic_Passion")
questDF[questDF.columns[[0,-3,-2,-1]] ]

                     Name Academic_Level Grade  Academic_Passion
0            Storm Madsen             D−    10                 2
1         Gordoslav Bosik              F    11                 1
2          آرمیتا محمدخان              A     3                 3
3          Daryl Chambers             C−    M1                 3
4      Bilogost Drizhenko             D+     6                 6
...                   ...            ...   ...               ...
16995       Eduardo Colin             B+    11                 4
16996   Olivia Kristensen             D−     7                 9
16997         Estela Rojo             B+    L2                 8
16998      Ivan Hillestad             C−    L1                 7
16999          مانی حسینی             D+     6                 4

[17000 rows x 4 columns]

### Failed School Years

In [562]:
questDF= fillState(questDF,24,"Years_Failed",0,4)
questDF[questDF.columns[[2,-4,-3,-2,-1]] ]

       Age Academic_Level Grade  Academic_Passion  Years_Failed
0       36             D−    10                 2             0
1       59              F    11                 1             2
2       36              A     3                 3             0
3       50             C−    M1                 3             2
4       71             D+     6                 6             0
...    ...            ...   ...               ...           ...
16995   73             B+    11                 4             3
16996   27             D−     7                 9             2
16997   67             B+    L2                 8             0
16998   67             C−    L1                 7             2
16999   67             D+     6                 4             3

[17000 rows x 5 columns]

## Commute
### Commute Distance

In [563]:
columnIndex= 17
distance=pd.Series( list(np.arange(0.5,6.5,0.1))+list(np.arange(6.5,15,0.3))+list(np.arange(15,25,.5))).apply(lambda a:round(a,2))
questDF[columnIndex]= np.random.choice(distance, questDF.shape[0])
questDF.rename(columns={columnIndex:"Commute_Distance"}, inplace=True)
questDF

,Name,Gender,Age,Ethnicity,Family_Status,Number_Caretakers,State_Caretakers,Number_Siblings,Order_Among_Siblings,State_Residence,...,State,State_State,State_School,State_Teachers,State_Classmates,Academic_Level,Grade,Academic_Passion,Years_Failed,Commute_Distance
0,Storm Madsen,male,36,Arab,Abandonned,4,2,2,2,5,...,Hovedstaden,2,7,3,2,D−,10,2,0,3.8
1,Gordoslav Bosik,male,59,Black,Adopted,2,10,3,2,9,...,Ivano-Frankivska,1,3,4,9,F,11,1,2,2.6
2,آرمیتا محمدخان,female,36,Black,extended family,5,5,3,3,9,...,خراسان رضوی,4,7,4,6,A,3,3,0,0.5
3,Daryl Chambers,male,50,Asian,step family,3,4,1,1,6,...,New South Wales,4,4,7,5,C−,M1,3,2,9.8
4,Bilogost Drizhenko,male,71,White,biological family,5,7,2,1,5,...,Odeska,4,4,6,5,D+,6,6,0,14.6
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
16995,Eduardo Colin,male,73,Black,extended family,4,9,2,1,9,...,Glarus,2,2,7,2,B+,11,4,3,4.7
16996,Olivia Kristensen,female,27,Black,Adopted,4,10,2,2,9,...,Hovedstaden,5,9,5,1,D−,7,9,2,5.4
16997,Estela Rojo,female,67,Arab,Adopted,1,2,4,1,6,...,Estado de Mexico,1,9,2,9,B+,L2,8,0,1.3
16998,Ivan Hillestad,male,67,Arab,Adopted,5,1,2,1,9,...,Møre og Romsdal,4,10,4,10,C−,L1,7,2,0.5
16999,مانی حسینی,male,67,Hispanic,extended family,5,9,4,3,7,...,بوشهر,1,8,5,1,D+,6,4,3,7.4

### Commute Method

In [564]:
columnIndex= 18
CommuteMethod=[{ "name": "car","speed":10}, { "name": "motorbike","speed":10}, { "name": "bus","speed":6},
               { "name": "metro","speed":4}, { "name": "train","speed":7}, {  "name":"taxi","speed":9},
               { "name": "walking","speed":1}, { "name": "bicycle","speed":6}]
questDF[columnIndex]= pd.Series(np.random.choice(CommuteMethod,questDF.shape[0])).apply(lambda x:dict(x).get("name"))
questDF.rename(columns={columnIndex:"Commute_Method"}, inplace=True)
questDF[questDF.columns[[0,-1]] ]

                     Name Commute_Method
0            Storm Madsen      motorbike
1         Gordoslav Bosik          metro
2          آرمیتا محمدخان      motorbike
3          Daryl Chambers      motorbike
4      Bilogost Drizhenko      motorbike
...                   ...            ...
16995       Eduardo Colin        walking
16996   Olivia Kristensen      motorbike
16997         Estela Rojo          train
16998      Ivan Hillestad          metro
16999          مانی حسینی      motorbike

[17000 rows x 2 columns]

### Commute Duration

In [565]:
columnIndex= 19
speed={"car":10,"motorbike":10,"bus":6,"metro":4,"train":7,"taxi":9,"walking":1,"bicycle":6}
questDF[columnIndex]=questDF["Commute_Method"].apply(lambda x: speed.get(x))
questDF[columnIndex]= (questDF['Commute_Distance'].astype("float")/questDF[columnIndex].astype("float") *60).astype("int")
questDF.rename(columns={columnIndex:"Commute_Duration"}, inplace=True)
questDF[questDF.columns[[0,-3,-2,-1]] ]

                     Name  Commute_Distance Commute_Method  Commute_Duration
0            Storm Madsen               3.8      motorbike                22
1         Gordoslav Bosik               2.6          metro                39
2          آرمیتا محمدخان               0.5      motorbike                 3
3          Daryl Chambers               9.8      motorbike                58
4      Bilogost Drizhenko              14.6      motorbike                87
...                   ...               ...            ...               ...
16995       Eduardo Colin               4.7        walking               282
16996   Olivia Kristensen               5.4      motorbike                32
16997         Estela Rojo               1.3          train                11
16998      Ivan Hillestad               0.5          metro                 7
16999          مانی حسینی               7.4      motorbike                44

[17000 rows x 4 columns]

### Commute State

In [566]:
questDF= fillState(questDF,20,"State_Commute")
questDF[questDF.columns[[0,-4,-3,-2,-1]] ]

,Name,Commute_Distance,Commute_Method,Commute_Duration,State_Commute
0,Storm Madsen,3.8,motorbike,22,9
1,Gordoslav Bosik,2.6,metro,39,8
2,آرمیتا محمدخان,0.5,motorbike,3,1
3,Daryl Chambers,9.8,motorbike,58,6
4,Bilogost Drizhenko,14.6,motorbike,87,4
...,...,...,...,...,...
16995,Eduardo Colin,4.7,walking,282,3
16996,Olivia Kristensen,5.4,motorbike,32,5
16997,Estela Rojo,1.3,train,11,6
16998,Ivan Hillestad,0.5,metro,7,9
16999,مانی حسینی,7.4,motorbike,44,9

## Work

In [567]:
columnIndex=25
workOrNot= [True,False]
questDF[columnIndex]= np.random.choice(workOrNot, questDF.shape[0])
questDF.rename(columns={columnIndex:"Work"}, inplace=True)

questDF[questDF.columns[[0,-1]]]

                     Name   Work
0            Storm Madsen   True
1         Gordoslav Bosik  False
2          آرمیتا محمدخان  False
3          Daryl Chambers   True
4      Bilogost Drizhenko  False
...                   ...    ...
16995       Eduardo Colin   True
16996   Olivia Kristensen  False
16997         Estela Rojo  False
16998      Ivan Hillestad  False
16999          مانی حسینی  False

[17000 rows x 2 columns]

### Type Of Work

In [568]:
name= "Work_Type"
jobs=['craftsmanship', 'repetitive labour', 'hobby', 'family business']
questDF[name]= np.where(questDF["Work"],np.random.choice(jobs,questDF.shape[0]),"")
questDF[questDF.columns[[0,-2,-1]]]

                     Name   Work          Work_Type
0            Storm Madsen   True    family business
1         Gordoslav Bosik  False
2          آرمیتا محمدخان  False
3          Daryl Chambers   True  repetitive labour
4      Bilogost Drizhenko  False
...                   ...    ...                ...
16995       Eduardo Colin   True      craftsmanship
16996   Olivia Kristensen  False
16997         Estela Rojo  False
16998      Ivan Hillestad  False
16999          مانی حسینی  False

[17000 rows x 3 columns]

### State Of Work

In [569]:
name= "State_Work"
questDF[name]= np.where(questDF["Work"],np.random.choice(list(range(1,11)),questDF.shape[0]),"")
questDF[questDF.columns[[0,-3,-2,-1]]]

                     Name   Work          Work_Type State_Work
0            Storm Madsen   True    family business          9
1         Gordoslav Bosik  False
2          آرمیتا محمدخان  False
3          Daryl Chambers   True  repetitive labour          8
4      Bilogost Drizhenko  False
...                   ...    ...                ...        ...
16995       Eduardo Colin   True      craftsmanship          8
16996   Olivia Kristensen  False
16997         Estela Rojo  False
16998      Ivan Hillestad  False
16999          مانی حسینی  False

[17000 rows x 4 columns]

## Dropout

In [570]:
name= "Dropout"
questDF[name]= np.random.choice([True,False],questDF.shape[0])
questDF[questDF.columns[[0,-3,-2,-1]]]

                     Name          Work_Type State_Work  Dropout
0            Storm Madsen    family business          9     True
1         Gordoslav Bosik                                  False
2          آرمیتا محمدخان                                   True
3          Daryl Chambers  repetitive labour          8     True
4      Bilogost Drizhenko                                   True
...                   ...                ...        ...      ...
16995       Eduardo Colin      craftsmanship          8     True
16996   Olivia Kristensen                                   True
16997         Estela Rojo                                   True
16998      Ivan Hillestad                                   True
16999          مانی حسینی                                  False

[17000 rows x 4 columns]

# Export

In [573]:
questDF.to_csv("questionnaire.csv", index=False, header=True)